Repository: laboratoriorma3/circularseasframework
Catalog: src/CircularSeasFramework/User/CircularSeasManager/Resources/AlertResources.*.resx
Languages: es_es, eu_es, fr_fr, gl, pt_pt

source: Accept
es_es: Aceptar
eu_es: Onartu
fr_fr: J'accepte
gl: Aceptar
pt_pt: Aceitar

# AllParametersMustProvide
source: You must select all the parameters
es_es: Debes seleccionar todos los parámetros
eu_es: Parametro guztiak hautatu behar dituzu
fr_fr: Vous devez sélectionner tous les paramètres
gl: Debe seleccionar todos os parámetros
pt_pt: Você deve selecionar todos os parâmetros

# CanPrintedFromLocal
source: File available for printing from local files
es_es: Archivo disponible para imprimir desde archivos locales
eu_es: Fitxategia tokiko fitxategietan inprimatzeko erabilgarri dago
fr_fr: Fichier disponible pour l'impression à partir de fichiers locaux
gl: Ficheiro dispoñible para imprimir desde ficheiros locais
pt_pt: Arquivo disponível para impressão de arquivos locais

source: Connection error
es_es: Error de conexión
eu_es: Konexioaren errorea
fr_fr: Erreur de connexion
gl: Erro de conexión
pt_pt: Erro de conexão

# DeletingBodyErrorProcesing
source: Cant't delete a file which is being printed
es_es: No puedo eliminar un archivo que se está imprimiendo
eu_es: Ezin da inprimatzen ari den fitxategirik ezabatu
fr_fr: Impossible de supprimer un fichier en cours d'impression
gl: Non se pode eliminar un ficheiro que se está a imprimir
pt_pt: Não é possível excluir um arquivo que está sendo impresso

# DeletingBodySelectOne
source: You must select a file to delete
es_es: Debes seleccionar un archivo para eliminar
eu_es: Ezabatu beharreko fitxategi bat hautatu behar duzu
fr_fr: Vous devez sélectionner un fichier à supprimer
gl: Debe seleccionar un ficheiro para eliminar
pt_pt: Você deve selecionar um arquivo para excluir

# DeletingHeader
source: Deleting failure
es_es: Eliminando falla
eu_es: Hutsegitea ezabatzen
fr_fr: Échec de la suppression
gl: Erro ao eliminar
pt_pt: Falha ao excluir

# DeletingReturn
source: Back
es_es: atrás
eu_es: Itzuli
fr_fr: Dos
gl: De volta
pt_pt: Voltar

# DisconnectedBack
source: Come to main menu
es_es: Ven al menú principal
eu_es: Zatoz menu nagusira
fr_fr: Venir au menu principal
gl: Ve ao menú principal
pt_pt: Venha para o menu principal

# DisconnectedBody
source: Can`t connect to Octoprint
es_es: No se puede conectar a Octoprint
eu_es: Ezin da Octoprint-era konektatu
fr_fr: Impossible de se connecter à Octoprint
gl: Non se pode conectar a Octoprint
pt_pt: Não consigo conectar ao Octoprint

# DisconnectedHeader
source: Connection error
es_es: Error de conexión
eu_es: Konexioaren errorea
fr_fr: Erreur de connexion
gl: Erro de conexión
pt_pt: Erro de conexão

# DisconnectedWait
source: Wait
es_es: Esperar
eu_es: Itxaron
fr_fr: Attendez
gl: Agarda
pt_pt: Esperar

source: Error
eu_es: Errorea
fr_fr: Erreur
gl: Erro
pt_pt: Erro

# FileNotProvided
source: No file has been provided
es_es: No se ha proporcionado ningún archivo
eu_es: Ez da fitxategirik eman
fr_fr: Aucun fichier n'a été fourni
gl: Non se forneceu ningún ficheiro
pt_pt: Nenhum arquivo foi fornecido

source: No
eu_es: Ez
fr_fr: Non
gl: Non
pt_pt: Não

# OrderStock
source: Order
es_es: Pedido
eu_es: Agindua
fr_fr: Ordre
gl: Orde
pt_pt: Pedido

# OutStock
source: Out of stock
es_es: Agotado
eu_es: Agortuta
fr_fr: Rupture de stock
gl: Esgotado
pt_pt: Fora de estoque

# OutStockMessage
source: There aren't stock for this kind of filament
es_es: No hay stock para este tipo de filamento
eu_es: Ez dago harizpi mota honetarako stockik
fr_fr: Il n'y a pas de stock pour ce genre de filament
gl: Non hai existencias para este tipo de filamentos
pt_pt: Não há estoque para este tipo de filamento

# PerhapsSupportNeeded
source: The request could not be completed. Try enabling support and if the problem persists, please contact an administrator.
es_es: No se ha podido completar la solicitud. Intente habilitar el soporte y si el problema persiste, comuníquese con un administrador.
eu_es: Eskaera ezin izan da bete. Saiatu laguntza gaitzen eta arazoak jarraitzen badu, jarri harremanetan administratzaile batekin.
fr_fr: La demande n'a pas pu être complétée. Essayez d'activer le support et si le problème persiste, veuillez contacter un administrateur.
gl: Non se puido completar a solicitude. Proba a habilitar a asistencia e se o problema persiste, ponte en contacto cun administrador.
pt_pt: A solicitação não pôde ser concluída. Tente habilitar o suporte e se o problema persistir, entre em contato com um administrador.

# PrintingBodyProcessing
source: Printer is processing a part. wait to end first
es_es: La impresora está procesando una pieza. espera a terminar primero
eu_es: Inprimagailua pieza bat prozesatzen ari da. itxaron lehenengo amaitzeko
fr_fr: L'imprimante traite une pièce. attendre la fin d'abord
gl: A impresora está procesando unha peza. agarda a rematar primeiro
pt_pt: A impressora está processando uma peça. espere para terminar primeiro

# PrintingBodySelectOne
source: You must select one file to print
es_es: Debe seleccionar un archivo para imprimir
eu_es: Inprimatzeko fitxategi bat hautatu behar duzu
fr_fr: Vous devez sélectionner un fichier à imprimer
gl: Debe seleccionar un ficheiro para imprimir
pt_pt: Você deve selecionar um arquivo para imprimir

# PrintingDirectly
source: Do you want to directly print the selected file?
es_es: ¿Quieres imprimir directamente el archivo seleccionado?
eu_es: Aukeratutako fitxategia zuzenean inprimatu nahi duzu?
fr_fr: Voulez-vous imprimer directement le fichier sélectionné ?
gl: ¿Quere imprimir directamente o ficheiro seleccionado?
pt_pt: Quer imprimir diretamente o arquivo selecionado?

# PrintingHeaderError
source: Printing failure
es_es: Error de impresión
eu_es: Inprimatzearen huts egin du
fr_fr: Échec d'impression
gl: Fallou a impresión
pt_pt: Falha de impressão

# PrintingReturn
source: Back
es_es: atrás
eu_es: Itzuli
fr_fr: Dos
gl: De volta
pt_pt: Voltar

# PrintingWorking
source: The printer is working. The file will be uploaded but you must wait for the current one to finish. Later you can select it from the local print menu
es_es: La impresora está funcionando. El archivo se cargará, pero debe esperar a que finalice el actual. Más tarde, puede seleccionarlo en el menú de impresión local
eu_es: Inprimagailua funtzionatzen ari da. Fitxategia kargatuko da, baina unea amaitu arte itxaron behar duzu. Geroago bertako inprimatze menuan hauta dezakezu
fr_fr: L'imprimante fonctionne. Le fichier sera téléchargé mais vous devez attendre que le fichier en cours se termine. Plus tard, vous pouvez le sélectionner dans le menu d'impression local
gl: A impresora está funcionando. O ficheiro cargarase pero debes esperar a que remate o actual. Máis tarde pódelo seleccionar no menú de impresión local
pt_pt: A impressora está funcionando. O arquivo será carregado, mas você deve esperar que o atual termine. Posteriormente, você pode selecioná-lo no menu de impressão local

source: Ready
es_es: Listo
eu_es: Prest
fr_fr: Prêt
gl: Listo
pt_pt: Preparar

# SelectMaterial
source: You must select one material
es_es: Debes seleccionar un material
eu_es: Material bat hautatu behar duzu
fr_fr: Vous devez sélectionner un matériau
gl: Debes seleccionar un material
pt_pt: Você deve selecionar um material

# ServerDisconnected
source: Can't connect to server. Try it later
es_es: No se puede conectar al servidor. Pruébelo más tarde
eu_es: Ezin da zerbitzarira konektatu. Saiatu geroago
fr_fr: Impossible de se connecter au serveur. Essayez plus tard
gl: Non se pode conectar ao servidor. Próbao máis tarde
pt_pt: Não é possível conectar ao servidor. Tente mais tarde

source: Success
es_es: Éxito
eu_es: Arrakasta
fr_fr: Succès
gl: Éxito
pt_pt: Sucesso

# SucessUpload
source: Uploaded successfully
es_es: Subido con éxito
eu_es: Behar bezala kargatu da
fr_fr: Téléchargé avec succès
gl: Cargouse correctamente
pt_pt: Carregado com sucesso

source: Unknown error
es_es: Error desconocido
eu_es: Errore ezezaguna
fr_fr: Erreur inconnue
gl: Erro descoñecido
pt_pt: Erro desconhecido

# UploadOnlyGCODE
source: Only files in .gcode format are supported. Upload failed
es_es: Solo se admiten archivos en formato .gcode. Subida fallida
eu_es: Gcode formatuko fitxategiak soilik onartzen dira. Ezin izan da kargatu
fr_fr: Seuls les fichiers au format .gcode sont pris en charge. Échec du téléchargement
gl: Só se admiten ficheiros en formato .gcode. Fallou a carga
pt_pt: Apenas arquivos no formato .gcode são suportados. Falha no upload

# UploadOnlySTL
source: You must select only stl files
es_es: Debe seleccionar solo archivos stl
eu_es: STL fitxategiak bakarrik hautatu behar dituzu
fr_fr: Vous devez sélectionner uniquement les fichiers stl
gl: Debe seleccionar só ficheiros stl
pt_pt: Você deve selecionar apenas arquivos stl

# WarningHeader
source: Warning
es_es: Advertencia
eu_es: Abisua
fr_fr: Avertissement
gl: Aviso
pt_pt: Aviso

source: Yes
es_es: sí
eu_es: Bai
fr_fr: Oui
gl: Si
pt_pt: sim

source: Quantity
es_es: Cantidad
eu_es: Kantitatea
gl: Cantidade

# OrderRegistered
source: Order registered successfully
es_es: Pedido registrado con éxito
eu_es: Eskaera behar bezala erregistratu da
fr_fr: Commande enregistrée avec succès
gl: Pedido rexistrado con éxito
pt_pt: Pedido registrado com sucesso

# OrderID
source: Order Identifier
es_es: Identificador de pedido
eu_es: Eskaera-identifikatzailea
fr_fr: Identifiant de commande
gl: Identificador do pedido
pt_pt: Identificador do pedido

# UwpOrder
source: On the desktop app, you can't scan a QR. Instead, select the order from the list displayed on the screen and then click this button to accept.
es_es: En la aplicación de escritorio, no puede escanear un QR. En su lugar, seleccione el pedido de la lista que se muestra en la pantalla y luego haga clic en este botón para aceptar.
eu_es: Mahaigaineko aplikazioan, ezin duzu QR bat eskaneatu. Horren ordez, hautatu ordena pantailan agertzen den zerrendatik eta egin klik botoi honetan onartzeko.
fr_fr: Sur l'application de bureau, vous ne pouvez pas numériser un QR. Au lieu de cela, sélectionnez la commande dans la liste affichée à l'écran, puis cliquez sur ce bouton pour accepter.
gl: Na aplicación de escritorio, non podes dixitalizar un QR. Pola contra, seleccione a orde da lista que aparece na pantalla e, a continuación, prema neste botón para aceptar.
pt_pt: No aplicativo para desktop, você não pode digitalizar um QR. Em vez disso, selecione o pedido na lista exibida na tela e clique neste botão para aceitar.

# UwpSpoolStock
source: On the desktop app, you can't scan a QR. Instead, select the material from the list that was displayed on the screen and then click this button to discard a spent spool.
es_es: En la aplicación de escritorio, no puede escanear un QR. En su lugar, seleccione el material de la lista que se muestra en la pantalla y luego haga clic en este botón para descartar un carrete gastado.
eu_es: Mahaigaineko aplikazioan, ezin duzu QR bat eskaneatu. Horren ordez, hautatu materiala pantailan bistaratzen zen zerrendatik eta egin klik botoi honetan agortutako spool bat baztertzeko.
fr_fr: Sur l'application de bureau, vous ne pouvez pas numériser un QR. Au lieu de cela, sélectionnez le matériau dans la liste affichée à l'écran, puis cliquez sur ce bouton pour jeter une bobine usagée.
gl: Na aplicación de escritorio, non podes dixitalizar un QR. Pola contra, seleccione o material da lista que se amosou na pantalla e, a continuación, prema neste botón para descartar unha bobina gastado.
pt_pt: No aplicativo para desktop, você não pode digitalizar um QR. Em vez disso, selecione o material da lista exibida na tela e clique neste botão para descartar um carretel gasto.

source: Material
eu_es: Materiala
fr_fr: Matériel

# SpendOneSpool
source: Confirms that you have spent 1 spool of
es_es: Confirma que ha gastado 1 bobina de
eu_es: Bobina bat gastatu duzula berresten du
fr_fr: Confirme que vous avez dépensé 1 bobine de
gl: Confirma que gastou 1 bobina de
pt_pt: Confirma que você gastou 1 carretel de

# SureConfirmOrders
source: Are you sure to confirm the order with the following data?
es_es: ¿Estás seguro de que confirmas el pedido con los siguientes datos?
eu_es: Ziur eskaera berresten duzula datu hauekin?
fr_fr: Êtes-vous sûr de confirmer la commande avec les données suivantes ?
gl: ¿Estás seguro que desexas confirmar o pedido cos seguintes datos?
pt_pt: Tem a certeza que confirma a encomenda com os seguintes dados?

source: Confirmation
es_es: Confirmación
gl: Confirmación
pt_pt: Confirmação
